[
    {
        "Img": "",
        "Title": "Be The IMD Champion – Quiz",
        "Content": "As we all know, International Men’s Day (IMD) is celebrated every year on 19 November, to celebrate men and their contributions to society. This year 2021, Save Indian Family Foundation SIFF decided to conduct an online quiz: Be the IMD Champion to raise awareness of men’s issues and to celebrate IMD.",
        "Video_Link": "",
        "Reference_Link": ""
    },
    {
        "Img": "",
        "Title": "SIFF Pune Team celebrates International Men’s Day in style",
        "Content": "International Men’s Day is observed each year on 19th November, to celebrate achievements of men and raise awareness about the issues faced by men in the society. Sadly, not many people know about this occasion, and even of they do, they will either belittle this day or mock this day. This is due to internalized misandry in the system. So it is up to Men’s Rights Activists to spread awareness and remove the misandry from the system and people’s minds. SIFF Pune team decided to spread awareness about International Men’s Day by organizing a fun event: A weekend outing to Mahabaleshwar. Over 25 activists participated in this event. The mission was to celebrate the Men’s Day weekend, enjoy a stress free outing and spread awareness about Men’s Day.",
        "Video_Link": "",
        "Reference_Link": ""
    },
    {
        "Img": "",
        "Title": "The increasing menace of sextortion for Indian Men",
        "Content": "With the repeated imposition of lockdowns and increasing use of video chats the sextortion rackets have made life miserable for men in various parts of India. A complaint at the Nagpur cyber cell of a 35-year-old Mumbai based businessman is the latest documented case of this relatively new blackmailing tool. The lockdown and later the partial restrictions related to the COVID19 pandemic has seen a surge in the number of complaints from male victims wherein they are being blackmailers, is threatening to make their videos and images viral on social media or send them to their relatives. A 54-year-old fashion designer had to pay up a substantial sum owing to such extortion.",
        "Video_Link": "",
        "Reference_Link": ""
    }
]