[
    {
        "Q": "What is SIFF?",
        "A": "SIFF is a prominent Men’s Rights Organiation in India. Its fights for men’s human rights and seeks to protect men and their families from Govt sponsored undemocratic social experiments."
    }, {
        "Q": "What is the Mission of SIFF?",
        "A": "SIFF’s Mission is to expose and create awareness about large scale violations of Civil Liberties and Human Rights in the name of women’s empowerment in India. SIFF works for ending Male Disposability in India and the world. Most of the common men are so much brainwashed by the society that they fail to see that Males are Disposable Gender and deaths of men often does not count for the societies across the world. For example, 3 times more men than women die in accidents, murders and suicides in India. Yet, this is not considered when people talk about gender equality. SIFF also supports male victims of domestic violence and false dowry cases. SIFF wants all the laws in India to be made gender neutral."
    }, {
        "Q": "What does SIFF do?",
        "A": "SIFF provides guidance and support to men and their families, who face domestic violence and false cases of dowry harassment and section 498a. SIFF protects these men and families from extortion by a corrupt police and court system, where laws are used to coerce men to cough up huge sums of money as out of court settlement, with complete disregard to basic principles of law and natural justice. SIFF works to prevent suicides of men, who are victims of domestic violence and false cases filed by wives. SIFF also campaigns for gender neutral laws and ending of misuse of all laws. SIFF often helps men get in touch with their inner selves and their emotions, so that these men can get peace, when they have marital problems."
    }, {
        "Q": "Why SIFF does not help female victims of domestic violence?",
        "A": "SIFF Specialises in Problems of Men, just he way Aeronautical Engineers specialize in building Air Crafts. The problems of Male Victims of domestic violence is very different from problems of female victims of domestic violence. The minds of men and women work differently. So, we have chosen to only specialize only in domestic violence faced by men. Anyway, no one should bother about this question as Government of India gives more than 2 billion dollars for preventing domestic violence and other crimes against women, while it gives “zero” money for preventing domestic violence against men or reducing male suicides. Govt also funds thousands of gross root women’s organisations to help women’s victims. Female victims can always call the women’s helplines run by police stations and NGOs. However, even today Government of Indian openly refuses to have any Helplines of Male Victims of Domestic Violence."
    }, {
        "Q": "Does SIFF save Marriages?",
        "A": "It depends. If a marriage problem has not escalated beyond control, SIFF guides individuals to save marriages. SIFF is not a Pro-Marriage, anti-divorce organisation. If women and men keep abusing each other inside marriage, they they must get divorced. If people are running around police stations and courts, then such marriages have to break. If there is too much possessiveness and control inside a marriage, that is unhealthy and at times dangerous. There is no point in tying two people with a 2 meter string of rope called marriage. That is hell and is a social torture of the people involved."
    }, {
        "Q": "Why SIFF is fighting for Men’s Rights, when it is a Male Dominated Society?",
        "A": "We are not living in a Male Dominated Society. The truth is, we always lived in an “Alpha Male” dominated society, where 1% men dominated rest 99% men and 100% women. These alpha males have vested interests in using women against men, most often in exchange for favour including sexual favours or just simply female attention. Men as a whole are not a homogeneous group. Men have very little in-group bias compared to women. Since ages men have brutalized and killed fellow men. Lets take an example, if you are in a lift with Bill Gates, then on an average everyone in the lift is a billionaire and is very rich. It is absurd, if Govt taxes you for being a billionaire, just because you shared a lift with him. Same way, some men being Presidents or CEOs does not make any difference for a man who is a coolie or a daily labourer or a Dalit. These poor and powerless men get no benefits due to one person of their gender being very rich or powerful. On the other hand, these poor and powerless men risk facing positive discrimination, because of that single rich and powerful alpha male. The feminists and the many people in Arts and Media have misled the society bt twisting and distorting the facts and the reality."
    }, {
        "Q": "What are SIFF’s views on Feminism and Women’s Movement?",
        "A": "SIFF has no problems at all with Feminism, provided:\nFeminism is focused on Gender Equality in all aspects of human life, including quality of life, access to social services, risks taken in life, suicide and accident rates, equal life expectancy.\nFeminist denounces positive discrimination of any gender and gender quotas.\nFeminists stop propagating false statistics and hoaxes by sticking to facts.\nFeminists stop their hate campaigns against all men, by stereotyping men as violent and evil. Hate does not solve any social problems, it can only worsen it.\nIt is simple common sense to understand that one can not apply “equality” in a selective way in some aspects of life, while promoting inequality in other aspects of life. That is hypocrisy and also stupid."
    }, {
        "Q": "What are SIFF’s views on Feminists?",
        "A": "Most feminists are intellectually challenged individuals, with very less academic grounding. They are basically frustrated angry individuals, who think intolerance and hate will improve conditions of women in the world. In reality, the condition of women improves due to technology, which mostly men created. Feminists are also extremely ungrateful people, who never get satisfied with any improvement in condition of women."
    }, {
        "Q": "Does SIFF charge a fee for its membership?",
        "A": "No. SIFF does not charge a fee for its membership or for attending its weekend meetings."
    }, {
        "Q": "What are SIFF’s views on Khap Panchayats, who claim women should be married by the age of 16?",
        "A": "SIFF does not associate itself with any Khap Panchayat or any such organisation which advocates taking away choices from people. At the same time, SIFF is against media bias and propaganda by main stream media against any group or community of people, who hold different views about the society. SIFF’s values are libertarian and SIFF opposes excessive control of people by Government or Corporate Media."
    }, {
        "Q": "Why SIFF calls itself Men’s Rights Organisation in the name of “Saving Families”?",
        "A": "The civil liberties of hundreds of thousands of people in India are violated as they are detained or jailed in false dowry cases by Indian Government. Members of these families, including women and children are abused, threatened and imprisoned by a law, that presumes them guilty until proven innocent. When a man is in danger, the family is in danger. When men are mistreated in a society, then families get destroyed. It is important to save innocent men and the families from Indian prisons. We actually, saved many families from prison and these families are grateful to us for their whole life. So, we call ourselves “Save Indian Family Foundation”. The society is so treacherously anti-male that it treats men worse than animals. If you throw a stone at a mad dog in the street, the whole society rises up against you today. However, the same hypocrite society advocates physical castration and lynching of men, who are falsely accused of domestic violence or falsely accused of rape, after their media trial. In fact, there are enough instances of such men being assaulted and no legal action was ever taken the by custodians of the society."
    }, {
        "Q": "Does SIFF agree that men commit more violence against women than the other way around?",
        "A": "Well, if the male and female gender roles are reversed, women will end up committing more crimes against men than the other way around. If women are given the social role of a “violent protector” of men, elders, children, religion, culture and nation, then they will certainly commit a lot of crime against fellow women and even men. Pushing men to a corner instead of freeing them from age old gender role of “Violent Protector”, is the root cause of crime by men. Free the men, there will be drastic reduction of crimes against everyone."
    }, {
        "Q": "How men are expected to be “violent protectors” by society? It not it nonsense?",
        "A": "Since the days of Gladiators and Musketeers, the society expected men to to be violent protectors. Even today, billions of people across the world love watching violence in movies. People throng to movie theaters to watch violent protectors like James Bond, Terminators and transporters. People remained glued to TVs in 1980s in India, to watch depiction of violent wars of Ramayana and Mahabharata. In Mahabharata, Lord Krishna advocated violence for protecting society and dharma."
    }, {
        "Q": "Of course, men have to fight for their country and society. How is that bad?",
        "A": "There is nothing called good violence and bad violence. Violence is violence and all violence is the same. The more men fought beasts in the wild, the more they started behaving like beasts. If you wish a violence free society, then the “violent male protector” role has to end completely. Today, in the name of protecting religion, men indulge in riots and terrorism. Then, to protect nations, they have created huge weapon arsenals and arms industry. All these are unnecessary. SIFF has a big intention for a peaceful world free from all violence."
    }, {
        "Q": "What are SIFF’s views about violent crimes against women like Rape in Inda?",
        "A": "In every society, there is crime. Policing is important. If police does not do their job properly in investigating or catching a culprit, then the solution is not to create draconian anti-rape laws without checks and balances. Today, men are charges with rape, if they have a break up in live-in relationship. Because, there are no checks and balances. Every person accused of rape must be presumed innocent until proven guilty. There are thousands of innocent men being framed in false rape cases. Subjecting a man to a false rape allegation and ruining his life, is equivalent to rape of the man by the society. The women leveling false allegations of rape are never punished in India or the world, because societies consider women as kids and think women do not have a brain of their own and hence women are not responsible for anything. In the end, if men are freed from violent protector role, if boys are not emotionally suppressed, if families are strengthened and if boys are protected from abuse by women during their childhood, we are sure the rate of rapes will drastically reduce in India."
    }, {
        "Q": "What are Political views of SIFF?",
        "A": "SIFF is not aligned to any political party in India. SIFF is not aligned to conservatives or socialists. SIFF is libertarian and believes in smaller Governments and very limited interference of Govts in personal lives and choices of people. Sometimes, SIFF members and leaders may get in touch or share platforms with people of other political affiliations, that does not mean we support views of those people and political parties. SIFF is also a secular organisation."
    }, {
        "Q": "What are SIFF’s views on Institution of Marriage?", 
        "A": "The institution of marriage is going through rapid changes all over the world. Today, people crave for more individuality and freedom than commitment, dedication, financial and emotional security. That is why the divorce rates are going up. This also means, quite a lot of people will eventually choose not to marry. SIFF respects people’s choices whether they choose to marry, live-in or remarry or not. The marriage rates in western countries are dropping and the same is reflecting in urban India. Breaking down of institution of marriage will have far reaching implications, but SIFF has no resources or capabilities to reverse this trend. We believe it is the duty of religious organisations and new age gurus etc, to save this institution, if at all it is needed to be saved. India is already over populated and hence Govt is creating policies to make marriages very costly for men. All SIFF members have free choices about their personal lives."
    }
]